This notebook has been created for you to practice three of the most common tools used in building any machine learning or data science applications, i.e., Pandas, NumPy, and SQL!

The practice questions provided will serve as a great resource for those who are looking to familiarize themselves with some of the most common functions used in these tools.

Appropriate descriptions have been provided for all the questions in this entire exercise which will help you navigate through this exercise easily. If a dataset is to be loaded in the python environment, that has also been provided for you. You can find it on the right panel in the Files section. Do NOT delete any of the files/folders listed there.

The whole exercise has been divided into nine separate notebooks. Below are the links to all the other notebooks for you to jump from one notebook to another:

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/notebook/6449493c84734151b11f4b6871f045d2#99f75bf946d04b9bb1daa9e14c2cfea9) 
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/notebook/notebook-0de50f3b70834570b13b651dde44c491) 

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/notebook/notebook-78e3faf901da4f14881ef24e41c80bf6) 

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/notebook/notebook-134ac20c38ef45e5a4432abd638e6c2e) 

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/notebook/notebook-07232b5ebafe49b198a9c55c553414f1) 

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/notebook/notebook-988aba30f33a45a3861adc4f6a6f338c)  

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/notebook/notebook-bb52759ea3f542eaaed9958b5df9c34b)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/notebook/notebook-697f04297c664d02901db0f85431512e)  **(This Notebook)**

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/notebook/notebook-e549236b988c42a5b53126a7ebb98127)

In [62]:
import pandas as pd
import pandasql as psql

In [63]:
data = pd.read_csv("../employee_dataset.csv")
data.head()

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

In [68]:
def query(_query, data = data):
    return psql.sqldf(_query, locals())

### Sample Query

In [69]:
query('SELECT * from data')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

### 1. Print the first five rows

In [70]:
query('SELECT * from data LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

### 2. Print the number of rows

In [71]:
query('SELECT COUNT(*) FROM data')

   COUNT(*)
0    300000

### 3. Print the first five rows of the Company_Name and Employment_Status Column

In [72]:
query('SELECT Company_Name, Employment_Status FROM data LIMIT 5')

                   Company_Name Employment_Status
0                James and Sons         Full Time
1                 Nichols-James         Full Time
2                     Scott Inc         Full Time
3  Johnston, Fleming and Tanner         Full Time
4      Baker, Allen and Edwards         Full Time

### 4. Print the first five rows where the Employee_Rating > 4.5

In [73]:
query('SELECT * FROM data WHERE Employee_rating > 4.5 LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
1,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
2,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
3,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860,Full Time,4.8
4,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7

### 5. Print the number of rows having Employee_Salary > 600000

In [74]:
query('SELECT COUNT(*) FROM data WHERE Employee_Salary > 600000')

   COUNT(*)
0    120013

### 6. Print the number of rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [75]:
query('SELECT COUNT(*) FROM data WHERE Employee_Salary > 600000 AND Employee_Rating > 4.5')

   COUNT(*)
0     10766

### 7. Print the first five rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [76]:
query('SELECT * FROM data WHERE Employee_Salary > 600000 AND Employee_Rating > 4.5 LIMIT 5')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
1,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
2,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7
3,Jonathan Armstrong,Scott Inc,Trading standards officer,Aliciafort,San Marino,902300,Full Time,4.8
4,Lori Smith,Thomas-Spencer,Optometrist,New Cindychester,Venezuela,687310,Full Time,4.8

### 8. Print all the distinct companies in the dataset

In [77]:
query('SELECT DISTINCT Company_Name FROM data')

                      Company_Name
0                   James and Sons
1                    Nichols-James
2                        Scott Inc
3     Johnston, Fleming and Tanner
4         Baker, Allen and Edwards
5                      Andrade LLC
6                     Matthews Inc
7                     Taylor-Ramos
8   Campos, Reynolds and Mccormick
9          White, Mcclain and Cobb
10                  Thomas-Spencer
11                Bullock-Carrillo
12               Marshall-Holloway
13      Wallace, Smith and Shepard
14                       Nelson-Li

### 9. Print the number of distinct companies in the dataset

In [78]:
query('SELECT COUNT(DISTINCT Company_Name) FROM data')

   COUNT(DISTINCT Company_Name)
0                            15

### 10. Print all the distinct companies, city pairs in the dataset

In [79]:
query('SELECT DISTINCT Company_Name, Employee_City FROM data')

                     Company_Name      Employee_City
0                  James and Sons     New Russellton
1                   Nichols-James  North Melissafurt
2                       Scott Inc           Wardfort
3    Johnston, Fleming and Tanner     West Jamesview
4        Baker, Allen and Edwards          Whiteside
..                            ...                ...
145       White, Mcclain and Cobb       Ricardomouth
146                 Nichols-James          Whiteside
147  Johnston, Fleming and Tanner     New Russellton
148                     Scott Inc     New Russellton
149                James and Sons       Whitakerbury

[150 rows x 2 columns]

### 11. Print the number of distinct companies, city pairs in the dataset

In [80]:
query('SELECT COUNT(*) FROM (SELECT DISTINCT Company_Name, Employee_City FROM data)')

   COUNT(*)
0       150

### 12. Print the number of Full time employees in the dataset.

In [81]:
query('SELECT * FROM data WHERE Employment_Status = "Full Time"')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
...,...,...,...,...,...,...,...,...
240005,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400,Full Time,1.5
240006,Steven Thornton,"Baker, Allen and Edwards",Patent examiner,Aliciafort,Benin,60240,Full Time,4.3
240007,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270,Full Time,3.6
240008,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
240009,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4

### 13. Print the number of employees with job title either 'Production engineer' or 'New Russellton'.

In [82]:
query('SELECT COUNT(*) FROM data WHERE Employee_Job_Title = "Production engineer" Or "New Russellton"')

   COUNT(*)
0     15003

### 14. Print the number of employees with job title either 'Production engineer' and company name 'Scott Inc'

In [83]:
query('SELECT COUNT(*) FROM data WHERE Employee_Job_Title = "Production engineer" AND Company_Name = "Scott Inc"')

   COUNT(*)
0      1036

### 15. Print the number of employees with job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [84]:
query('SELECT COUNT(*) FROM data WHERE (Employee_Job_Title = "Production engineer" OR "New Russellton") AND (Company_Name = "Scott Inc" OR "Baker, Allen and Edwards")')

   COUNT(*)
0      1036

### 16. Print the number of distinct cities with employees having job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [86]:
query('SELECT COUNT(DISTINCT Employee_city) FROM data WHERE (Employee_Job_Title = "Production engineer" OR "New Russellton") AND (Company_Name = "Scott Inc" OR "Baker, Allen and Edwards")')

   COUNT(DISTINCT Employee_city)
0                             10

### 17. Print the number of Intern employees in the dataset.

In [87]:
query('SELECT COUNT(*) FROM data WHERE Employment_Status = "Intern"')

   COUNT(*)
0     59990

### 18. Print the number of employees with first name 'Matthew'.

In [93]:
query('SELECT COUNT(*) FROM data WHERE SUBSTR(Name, 1, INSTR(Name, " ") -1 ) = "Matthew"')

   COUNT(*)
0      3063

### 19. Print the first five rows corresponding to the employees with highest salary

### 20. Print the first five rows corresponding to the employees with the highest salary in 'James and Sons' company

### 21. Print the first five rows corresponding to the employees with the highest salary working either in 'James and Sons' company or living in 'Wardfort' city

### 22. Print the total number of distinct records in the data.

### 23. Print the mean salary of all the employees in the data

### 24. Print the mean rating of all the employees in the data

### 25-27. Print the maximum, minimum and median Employee_Salary.

### 28-32. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

2. Employee_Job_Title

3. Employee_City

4. Employee_Country

5. Employment_Status

### 33. Print the company with the most number of employees.

### 34. Print the number of employees in the above company.

### 35. Print the company with the least number of employees.

### 36. Print the number of employees in the above company.

### 37. Print the employee details with the maximum salary

### 38. Print the employee details with the maximum rating

### 39. Print the Company_Name with most number of employees in 'Wardfort' city.

### 40. Print 'Employee_Salary' column as string.

### 41. Print the Employee_City with the most number of 'Production engineer'.

### 42. Print the Company_Name with the most number of Full-time Employees.

### 43. Print the Company_Name with the highest average 'Employee_Rating'.

### 44. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

### 45. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

### 46. Check if any of the columns has NULL values.

### 47. Print the data type of every column in the data.

### 48. Print the number of employees with Employee_Rating greater than the average Employee_Rating

### 49. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

### 50. Sort the table in ascending order of Employee_Salary

### 51. Sort the table in descending order of Employee_Rating

### 52. Print the name of 100th employee after sorting on Name column

### 53. Print the first 5 rows of the first 5 columns.

### 54. Print the number of employees whose first name starts with the letter 'V'.

### 55. Print the number of employees whose last name starts with the letter 'R'.

### 56. Select the rows 2 to 7 and the columns 3 to 7 (both included)